---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.SelectionFailures
source: html/027c3831-3eae-0a5a-8512-e30773a37ee7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SelectionFailures

Failures about Selections.

## Syntax (C#)
```csharp
public static class SelectionFailures
```